Ran Plan for 2 projects:

1. project: `infradev` dir: `infraeks` workspace: `dev`
1. project: `infraprod` dir: `infraeks` workspace: `prod`

### 1. project: `infradev` dir: `infraeks` workspace: `dev`
**Plan Error**
```
running "/usr/bin/terraform workspace new dev" in "/home/buildmgr/.atlantis/repos/mjgit007/eks_sample/3/dev/NFXGM4TBMVVXG===/infraeks": exit status 1: state data in S3 does not have the expected content.

This may be caused by unusually long delays in S3 processing a previous state
update.  Please wait for a minute or two and try again. If this problem
persists, and neither S3 nor DynamoDB are experiencing an outage, you may need
to manually verify the remote state and update the Digest value stored in the
DynamoDB table to the following value: 


 Please verify the terraform plan output of Dev instance . If output looks fine , then apply the changes and Merge the codebase

```

---
### 2. project: `infraprod` dir: `infraeks` workspace: `prod`
<details><summary>Show Output</summary>

```diff
 Please verify the terraform plan output of Prod instance . If output looks fine , then apply the changes and Merge the codebase

Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_vpc.example will be created
+ resource "aws_vpc" "example" {
      + arn                                  = (known after apply)
      + cidr_block                           = "30.0.0.0/28"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "env"  = "prod"
          + "name" = "prod-vpc"
        }
      + tags_all                             = {
          + "env"  = "prod"
          + "name" = "prod-vpc"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
Releasing state lock. This may take a few moments...

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p infraprod`
* :put_litter_in_its_place: To **delete** this plan click [here](https://455f-142-93-45-192.eu.ngrok.io/lock?id=mjgit007%252Feks_sample%252Finfraeks%252Fprod)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p infraprod`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
